//------------------------------------------------------------------------------
#ifndef __Riddle__
#define __Riddle__

//------------------------------------------------------------------------------
// Rectangle.h - содержит описание класса прямоугольника,
// порожденного от базового класса Figure
//------------------------------------------------------------------------------

#include "Wisdom.h"

//------------------------------------------------------------------------------
// прямоугольник
class Riddle : public Wisdom
{
public:
	string riddle, answer; // ширина, высота
	// переопределяем интерфейс класса
	void InData(ifstream& ifst);  // ввод данных из потока
	void Out(ofstream& ofst);     // вывод данных в стандартный поток

	// создание без инициализации.
	Riddle() {}
};

//------------------------------------------------------------------------------
// Фабрика, обеспечивающая создание прямоугольников при чтении признака фигуры
class RiddleFactory: public WisdomFactory {
public:
	// Конструктор фабрики, устанавливющий признак прямоугольника (равен 1)
	RiddleFactory():WisdomFactory(3) { }

	// Переопределение метода Create на создание прямоугольников.
	Wisdom* Create(int key) {
		if (key == mark)
			return new Riddle;
		else
			return nullptr;
	}
};

#endif

