#include "Riddle.h"

//------------------------------------------------------------------------------
// Ввод параметров прямоугольника
void Riddle::InData(ifstream& ifst) {
	ifst >> riddle >> answer;
}

//------------------------------------------------------------------------------
// Вывод параметров прямоугольника
void Riddle::Out(ofstream& ofst) {
	ofst << "Riddle. Riddle: " << riddle << " Answer: " << answer << endl;
}

//------------------------------------------------------------------------------
namespace {
	RiddleFactory rf;
}